nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe247/cmsis_driver_examples/enet/txrx_transfer/pin_mux.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTC3 (number 42), PHY_RESET
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PHY_RESET_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PHY_RESET_INIT_GPIO_VALUE 1U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_PHY_RESET_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PHY_RESET_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PHY_RESET_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PHY_RESET_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void ENET0_InitPins(void);

#define PORT_DFER_DFE_0_MASK 0x01u      /*!<@brief Digital Filter Enable Mask for item 0. */
#define PORT_DFER_DFE_11_MASK 0x0800u   /*!<@brief Digital Filter Enable Mask for item 11. */
#define PORT_DFER_DFE_12_MASK 0x1000u   /*!<@brief Digital Filter Enable Mask for item 12. */
#define PORT_DFER_DFE_17_MASK 0x020000u /*!<@brief Digital Filter Enable Mask for item 17. */
#define PORT_DFER_DFE_1_MASK 0x02u      /*!<@brief Digital Filter Enable Mask for item 1. */
#define PORT_DFER_DFE_2_MASK 0x04u      /*!<@brief Digital Filter Enable Mask for item 2. */
#define PORT_DFER_DFE_4_MASK 0x10u      /*!<@brief Digital Filter Enable Mask for item 4. */
#define PORT_DFER_DFE_7_MASK 0x80u      /*!<@brief Digital Filter Enable Mask for item 7. */
#define PORT_DFER_DFE_8_MASK 0x0100u    /*!<@brief Digital Filter Enable Mask for item 8. */

/*!
 * @brief This is a de-initialization function for 'ENET0_InitPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void ENET0_DeinitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
